---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToDeleteWallForPanel
source: html/d94212c3-94a9-00fa-6c57-5b6472c22086.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToDeleteWallForPanel Property

Unable to delete curtain panel wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToDeleteWallForPanel { get; }
```